In [1]:
import pandas as pd

series=1d labelled array
dataframe=2d labelled array

In [2]:
info={
  "name":["Harshit","Hitesh"],
  "cgpa":[9.5,8.9]
}

df=pd.DataFrame(info)
print(df)

      name  cgpa
0  Harshit   9.5
1   Hitesh   8.9

In [3]:
df #keys are header and values into rows with labels

      name  cgpa
0  Harshit   9.5
1   Hitesh   8.9

In [4]:
ds=pd.Series([1,2,3,4,5])
ds
print(type(ds),ds) #dtype is also printed together

<class 'pandas.Series'> 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
#custom labels
s=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
s
print(s['c'])
print(s.index)

3
Index(['a', 'b', 'c', 'd', 'e'], dtype='str')

In [6]:
#vectorization=no loops drop(index)

s1=pd.Series([10,20,30,40])
s2=pd.Series([2,3,4,5])
print(s1+s2)

s1[0]=100
new_s1=s1.drop(0) #size immutable in pandas so new s1 is created
print(s1)
s2=s2.add(100)
print(s2)
print(new_s1)

0    12
1    23
2    34
3    45
dtype: int64
0    100
1     20
2     30
3     40
dtype: int64
0    102
1    103
2    104
3    105
dtype: int64
1    20
2    30
3    40
dtype: int64

In [7]:
info={
  "name":["Harshit","Hitesh"],
  "cgpa":[9.5,8.9],
  "age":[20,16]
}

df1=pd.DataFrame(info)
df1

#label change
print(df1.index)
print(df1.columns)

RangeIndex(start=0, stop=2, step=1)
Index(['name', 'cgpa', 'age'], dtype='str')

In [8]:
#list in list
df_list=pd.DataFrame([["Harshit",20],["Hitesh",16],["Kiran",54],["Davinder",54]],columns=["Name","Age"])
df_list

       Name  Age
0   Harshit   20
1    Hitesh   16
2     Kiran   54
3  Davinder   54

In [9]:
#numpy array

import numpy as np
np_array=np.array([["Harshit",20],["Hitesh",16],["Kiran",54],["Davinder",54]])
df_np=pd.DataFrame(np_array,columns=["Name","Age"])
df_np

       Name Age
0   Harshit  20
1    Hitesh  16
2     Kiran  54
3  Davinder  54

In [10]:
#open csv and json files

df_csv=pd.read_csv("raw_data.csv")
print(df_csv,type(df_csv))
df_json=pd.read_json("print.json")
print(df_json,type(df_json))

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0 <class 'pandas.DataFrame'>
       name  rating                   feedback   age
0     Alice     5.0            Great product!!    25
1       Bob     4.0       ok but late Delivery    30
2   Charlie     2.0            BAD EXPERIENCE   None
3     Diana     5.0                  Loved it!    28
4       Eve     3.5  Average - could be better    20 <class 'pandas.DataFrame'>

In [11]:
#dataframe methods
df_csv.head()
df_csv.tail()
df_csv.sample(2)
df_csv.info()
df_csv.shape
df_csv.describe()
df_csv.columns
df_csv.nunique()

<class 'pandas.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       11 non-null     int64
 1   name     10 non-null     str
 2   age      8 non-null      float64
 3   country  10 non-null     str
 4   gender   10 non-null     str
 5   income   10 non-null     float64
dtypes: float64(2), int64(1), str(3)
memory usage: 660.0 bytes

id         10
name        9
age         6
country     6
gender      3
income      8
dtype: int64

In [12]:
df_aqi=pd.read_csv("data_date.csv")
df_aqi.head()
df_aqi.tail()
df_aqi.sample(2)
df_aqi.info()
df_aqi.describe()
df_aqi.shape
df_aqi.columns
df_aqi.nunique()

<class 'pandas.DataFrame'>
RangeIndex: 23423 entries, 0 to 23422
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       23423 non-null  str
 1   Country    23423 non-null  str
 2   Status     23423 non-null  str
 3   AQI Value  23423 non-null  int64
dtypes: int64(1), str(3)
memory usage: 732.1 KB

Date         173
Country      142
Status         6
AQI Value    369
dtype: int64

In [ ]:
df[]